controllers/ApiController.php

    public function actionPatientList()
    {
        // Retrieve the auth_cookie value from the request header
        $authCookie = Yii::$app->request->cookies->getValue('auth_cookie');

        // Get the authKey from the request
        $authKey = Yii::$app->request->get('authKey');

        if (empty($authCookie) && empty($authKey)) {
            // Return an error response if both authKey and auth_cookie are missing
            Yii::$app->response->format = Response::FORMAT_JSON;
            Yii::$app->response->setStatusCode(401);
            return [
                'error' => 'Unauthorized. Invalid auth key or auth cookie is missing.',
            ];
        }

        // Check if authKey is provided and find the user by authKey in the User model
        if (!empty($authKey)) {
            $user = User::findOne(['auth_key' => $authKey]);
---
SELECT * FROM `user` WHERE `auth_key`='ogvm05q-yOqZJSHJ_rAzJLcYPstyrDnL'

    public function actionCreatePatient()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        // Retrieve the auth_cookie value from the request header
        $authCookie = Yii::$app->request->cookies->getValue('auth_cookie');

        // Get the authKey from the request
        $authKey = Yii::$app->request->get('authKey');

        if (!empty($authCookie) || !empty($authKey)) {
            // Check if authKey is provided and find the user by authKey in the User model
            if (!empty($authKey)) {
                $user = User::find()->where(['auth_key' => $authKey])->one();
---
SELECT * FROM `user` WHERE `auth_key`='ogvm05q-yOqZJSHJ_rAzJLcYPstyrDnL'